Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_uart_type.h
	struct {
		__IOM uint32_t wls0       : 1;            /*!< [0..0] Word length selection,                                             */
		__IM  uint32_t            : 1;
		__IOM uint32_t stb        : 1;            /*!< [2..2] This bit specifies the number of Stop bits transmitted
                                                   and received in each serial character. 0: 1 stop bit. 1:
                                                   2 stop bits. Note that the receiver always checks the first
                                                   stop bit only.                                                            */
		__IOM uint32_t parity_en  : 1;            /*!< [3..3] Parity Enable                                                      */
		__IOM uint32_t even_parity_sel : 1;       /*!< [4..4] Even Parity select                                                 */
		__IOM uint32_t stick_parity_en : 1;       /*!< [5..5] Stick Parity enable control. LCR[5:4]: 00: Odd Parity
                                                   01: Even Parity 10: Stick Parity as 0 11: Stick Parity
                                                   as 1                                                                      */
		__IOM uint32_t break_ctrl : 1;            /*!< [6..6] Break Control bit. Break control bit causes a break condition
                                                   to be transmitted to the receiving UART.                                  */
		__IOM uint32_t dlab       : 1;            /*!< [7..7] Divisor Latch Access bit Note: DLL/DLM only can be access
                                                   when dlab bit = 1, IER only can be access when dlab bit
                                                   = 0. THR/RBR don't care about dlab bit value                              */
	} b;                                        /*!< bit fields for uart_lcr */
} uart_lcr_t, *puart_lcr_t;

/**
  \brief Union type to access uart_mcr (@ 0x00000010).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000010) Modem Control Register                                     */

	struct {
		__IOM uint32_t dtr        : 1;            /*!< [0..0] Data Terminal Ready (DTR) signal control 0::DTR is logic
                                                   1 1::DTR is logic 0                                                       */
		__IOM uint32_t rts        : 1;            /*!< [1..1] Request to Send (RTS) signal control 0: RTS is logic
                                                   1 1: RTS is logic 0 The RTS output is controlled as following
                                                   equation: RTS_output = rts_en ? (~rts|FIFO_FlowCtrl):~rts                 */
		__IOM uint32_t out1       : 1;            /*!< [2..2] This bit controls the Output 1 (OUT1_) signal, which
                                                   is an auxiliary user-designated output.                                   */
		__IOM uint32_t out2       : 1;            /*!< [3..3] This bit controls the output 2 (OUT2_) signal, which
                                                   is an auxiliary user-designated output.                                   */
		__IOM uint32_t loopback_en : 1;           /*!< [4..4] LoopBack mode. This bit provides a local loopback feature
                                                   for diagnostic testing of the UART.                                       */
		__IOM uint32_t cts_en     : 1;            /*!< [5..5] CTS flow control enable (CTSE) This Bit (CTSE) is the
                                                   auto CTS flow control enable. When set (1), the auto CTS
                                                   flow control as described in the detailed description is
                                                   enabled.                                                                  */
		__IOM uint32_t rts_en     : 1;            /*!< [6..6] RTS flow control enable (RTSE) This Bit (RTSE) is the
                                                   auto RTS flow control enables. When set (1), the auto RTS
                                                   flow control as described in the detailed description is
                                                   enabled.                                                                  */
		__IOM uint32_t sw_cts     : 1;            /*!< [7..7] Software controlled CTS. The software can use this bit
                                                   to pause the UART transmission, just like the HW flow control.This
                                                   bit setting will effects the CTS flow-control: CTS = cts_en
                                                   ? (sw_cts | CTS_input) : sw_cts                                           */
	} b;                                        /*!< bit fields for uart_mcr */
} uart_mcr_t, *puart_mcr_t;

/**
  \brief Union type to access uart_lsr (@ 0x00000014).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000014) Line Status Register                                       */

	struct {
		__IM  uint32_t rxfifo_datardy : 1;        /*!< [0..0] Data Ready (DR) indicator This bit is 1 when at least
                                                   one character has been received and transferred into the
                                                   FIFO. It be reset to logic 0 by reading all of the data
                                                   in the Receiver Buffer Register or the RX FIFO.                           */
		__IM  uint32_t overrun_err : 1;           /*!< [1..1] Overrun Error (OE) indicator. This bit is set (1) to
                                                   indicates that data in the RX FIFO was not read by the
                                                   CPU before the next character was transferred into the
                                                   RX FIFO,                                                                  */
		__IM  uint32_t parity_err : 1;            /*!< [2..2] Parity Error (PE) indicator. This bit is set to indicates
                                                   that the received data character does not have the correct
                                                   even or odd parity, as selected by the even-parity-select
                                                   bit.                                                                      */
		__IM  uint32_t framing_err : 1;           /*!< [3..3] Framing Error (FE) indicator. This bit is set when the
                                                   received character at the top of the FIFO did not have
                                                   a valid stop bit.                                                         */
		__IM  uint32_t break_err_int : 1;         /*!< [4..4] Break Interrupt (BI) indicator. This bit is set to logic
                                                   1 whenever the received data input is held in the Spacing
                                                   (logic 0) state for a longer than a full word transmission
                                                   time.                                                                     */
		__IM  uint32_t txfifo_empty : 1;          /*!< [5..5] TXFIFO empty indicator. It indicates that the Transmitter
                                                   FIFO is empty. This bit is set when the Transmitter FIFO
                                                   is empty; it is cleared when at least 1 byte is written
                                                   to the Transmitter FIFO.                                                  */
		__IM  uint32_t            : 1;
		__IM  uint32_t rxfifo_err : 1;            /*!< [7..7] Uart_rx_error. This bit is set when there is at least
                                                   on parity error, framing error or break indication in the
                                                   FIFO. It is clear when the CPU reads the LSR, if there
                                                   are no subsequent errors in the FIFO                                      */
	} b;                                        /*!< bit fields for uart_lsr */
} uart_lsr_t, *puart_lsr_t;

/**
  \brief Union type to access uart_msr (@ 0x00000018).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000018) Modem Status Register                                      */

