Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_uart_type.h
	struct {
		__IOM uint32_t irda_enable : 1;           /*!< [0..0] IRDA mode enable control. When set this bit as 1, the
                                                   UART is co-work with IRDA SIR mode. i.e., txd/rxd are irda
                                                   signals.                                                                  */
		__IOM uint32_t txdma_en   : 1;            /*!< [1..1] TX DMA enable control. (valid when dma_mode in FCR is
                                                   1)                                                                        */
		__IOM uint32_t rxdma_en   : 1;            /*!< [2..2] RX DMA enable control. (valid when dma_mode in FCR is
                                                   1)                                                                        */
		__IOM uint32_t txdma_burstsize : 5;       /*!< [7..3] Txdma burstsize                                                    */
		__IOM uint32_t rxdma_burstsize : 6;       /*!< [13..8] Rxdma burstsize                                                   */
		__IOM uint32_t irda_tx_inv : 1;           /*!< [14..14] Invert irda_tx_o when this bit is 1.                             */
		__IOM uint32_t irda_rx_inv : 1;           /*!< [15..15] Invert irda_rx_i when this bit is 1.                             */
		__IOM uint32_t tx_en      : 1;            /*!< [16..16] The UART TX function.enable control                              */
	} b;                                        /*!< bit fields for uart_miscr */
} uart_miscr_t, *puart_miscr_t;

/**
  \brief Union type to access uart_txplsr (@ 0x0000002C).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x0000002C) IRDA SIR TX Pulse Width Control 0 Register                 */

	struct {
		__IOM uint32_t txpulse_lowbound_shiftval : 15;/*!< [14..0] The shift value of SIR tx pulse's left edge position.         */
		__IOM uint32_t lowbound_shiftright : 1;   /*!< [15..15] SIR TX pulse lower bond shift control.                           */
		__IOM uint32_t txpulse_upperbound_shiftval : 15;/*!< [30..16] The shift value of SIR tx pulse's right edge position.     */
		__IOM uint32_t Upperbound_shiftright : 1; /*!< [31..31] SIR TX pulse upper bond shift control.                           */
	} b;                                        /*!< bit fields for uart_txplsr */
} uart_txplsr_t, *puart_txplsr_t;

/**
  \brief Union type to access uart_baudmonr (@ 0x00000034).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000034) Baud Monitor Register                                      */

	struct {
		__IM  uint32_t min_fall_space : 12;       /*!< [11..0] Min_fall_space                                                    */
		__IM  uint32_t min_low_period : 12;       /*!< [23..12] Min_low_period                                                   */
		__IOM uint32_t falling_thresh : 6;        /*!< [29..24] Falling_thresh                                                   */
		__IM  uint32_t mon_data_vld : 1;          /*!< [30..30] The monitor data valid indication                                */
		__IOM uint32_t toggle_mon_en : 1;         /*!< [31..31] Baud monitor toggle bit enable.                                  */
	} b;                                        /*!< bit fields for uart_baudmonr */
} uart_baudmonr_t, *puart_baudmonr_t;

/**
  \brief Union type to access uart_dbg2 (@ 0x0000003C).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x0000003C) Debug Register                                             */

	struct {
		__IM  uint32_t dbg_uart   : 32;           /*!< [31..0] The debug port output value, depend on dbg_sel value
                                                   in SCR[2:0].                                                              */
	} b;                                        /*!< bit fields for uart_dbg2 */
} uart_dbg2_t, *puart_dbg2_t;

/**
  \brief Union type to access uart_rfcr (@ 0x00000040).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000040) RX Filter Control Register                                 */

	struct {
		__IOM uint32_t rf_len     : 1;            /*!< [0..0] Set the length of received data to be check. 0/1 = 1bytes/2bytes   */
		__IOM uint32_t rf_mask_en : 1;            /*!< [1..1] Enable the mask operation for received data.                       */
		__IOM uint32_t rf_cmp_op  : 2;            /*!< [3..2] Set the RX filter comparing rule. The matched condition
                                                   is listed as following table: RF_LEN = 0: RF_CMP_OP = 0
                                                   (AND) 1st byte = Magic Pattern1 1 (OR) (1st byte = Magic
                                                   Pattern1) OR (1st byte = Magic Pattern2) 2 (XOR) (1st byte
                                                   != Magic Pattern1) AND (1st byte != Magic Pattern2) RF_LEN
                                                   = 1: RF_CMP_OP = 0 (AND) (1st byte = Magic Pattern1) AND
                                                   (2nd byte = Magic Pattern2) 1 (OR) (2nd byte = Magic Pattern1)
                                                   OR (2nd byte = Magic Pattern2) 2 (XOR) (1st byte != Magic
                                                   Pattern1) AND (2nd byte != Magic Patte                                    */
		__IM  uint32_t            : 3;
		__IOM uint32_t rf_en      : 1;            /*!< [7..7] RX Filter enable control                                           */
	} b;                                        /*!< bit fields for uart_rfcr */
} uart_rfcr_t, *puart_rfcr_t;

/**
  \brief Union type to access uart_rfmpr (@ 0x00000044).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000044) RX Filter Magic Pattern Register                           */

	struct {
		__IOM uint32_t rf_mp1     : 8;            /*!< [7..0] The magic pattern1 for the 1st received byte checking.             */
		__IOM uint32_t rf_mp2     : 8;            /*!< [15..8] The magic pattern2 for the 2nd received byte checking.            */
	} b;                                        /*!< bit fields for uart_rfmpr */
} uart_rfmpr_t, *puart_rfmpr_t;

/**
  \brief Union type to access uart_rfmvr (@ 0x00000048).
*/
typedef union {
	__IOM uint32_t w;                           /*!< (@ 0x00000048) RX Filter Mask Value Register                              */

